Tekla Open API Reference for Tekla Structures 2025
Surfacing.SurfacingAttributes.Representation Property
 The representation type of the surfacing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Surfacing.Representation Representation { get; set; }
Public Property Representation As Surfacing.Representation
	Get
	Set
Property Value
Type: Surfacing.Representation
See Also
Reference
Surfacing.SurfacingAttributes Class
Tekla.Structures.Drawing Namespace